#Вариант 20
#Составить программу решения линейного уравнения ax+b=0 (a не равно 0).

print('Введите a,b')
a = float(input())
b = float(input())

x=(-b/a)

print(x)
